{
  "messageId": "18884dbd037f4239",
  "subject": "U.S. DoS - CEAC Confirmation (AA00BY2SZF)",
  "date": "Sun, 4 Jun 2023 01:22:56 -0400",
  "timestamp": 1685856176.0,
  "attachmentName": "CEACAA00BY2SZF.PDF",
  "gmailQueryUsed": "subject:confirmation",
  "targetMimes": [
    "application/pdf"
  ],
  "attachmentContentText": "Select Tooltip Language EnglishExit•Online Nonimmigrant Visa Application (DS-160)      Name Provided:SATHWARA, AUM VINODCHANDRADate Of Birth:28 NOV 2001Place of Birth:JUNAGADH, INDIAGender:MaleCountry/Region of Origin (Nationality) :INDIAPassport Number:S3639845Purpose of Travel:STUDENT (F1)Completed On:04 JUN 2023Confirmation No:AA00BY2SZFTHIS IS NOT A VISA Location Selected:BMB U.S. Consulate General Mumbai  C-49, G-Block, (Near Hotel Trident - BKC) Bandra Kurla Complex,  Bandra East,   Mumbai 400051, India  Version 01.08.08Print ConfirmationPrint ApplicationEmail Confirmation  Note: Electronically submitting your DS-160 online application is the FIRST STEP in the visa application process. The next step is to review the internet page of the embassy or consulate where you plan to apply for your visa. Most visa applicants will need to schedule a visa interview, though some applicants may qualify for visa renewal. The embassy or consulate information may include specific local instructions about scheduling interviews, submitting your visa application, and other frequently asked questions. YOU MUST BRING the confirmation page and the following document(s) with you to the Application Service Center:Passport; I-20A or B/or I-20MN; Proof of SEVIS registration and fee paymentYou may also provide any additional documents you feel will support your case.ConfirmationThis confirms the submission of the Nonimmigrant visa application for:\fInstructionsYOU MUST SUBMIT the confirmation page with a clear and legible barcode at the time of your interview. If you do not have access to a printer at this time, select the option to email your confirmation page to an email address. You may print or email your application for your own records. YOU DO NOT need to submit the application at the time of the interview.Please note that you will be required to provide proof that you have paid the visa application fee and any other fees associated with your application. There may be other fees associated with the visa application process. Please check your country's Reciprocity Schedule for any other fees you may owe.If you have further questions, or to find out how to contact the Consular Post, please go to https://in.usembassy.gov/visas/ or http://travel.state.gov.You have indicated that you are applying for a F, M, or J visa. If you are not returning to the same program and/or you fell out of student status, you must pay a SEVIS fee ( http://www.ice.gov/sevis/ ). You should bring your SEVIS fee receipt with you to your interview. The fee should be paid at least three business days prior to your scheduled appointment date.NOTE: Unless exempt from an interview, you will be required to sign your application by providing a biometric signature, i.e. your fingerprint before a consular officer. By providing this biometric signature you are certifying under penalty of perjury that you have read and understood the questions in your nonimmigrant visa application and that all statements that appear in your nonimmigrant visa application have been made by you and are true and complete to the best of your knowledge and belief. Furthermore at the time of your interview, you will be required to certify under penalty of perjury that all statements in your application and those made during your interview are true and compete to the best of your knowledge and belief.You electronically signed your application on 04-Jun-2023 01:19:45 (GMT-05:00). You were required to electronically sign your application yourself, unless otherwise exempt by regulation, even if the application was prepared by someone other than yourself. Your electronic signature certifies that you have read and understood the questions in this application and that your answers are true and correct to the best of your knowledge and belief. The submission of an application containing any false or misleading statements may result in the permanent refusal of a visa or the denial of entry into the United States. All declarations made in this application are unsworn declarations made under penalty of perjury. (28 U.S.C. 1746).You certified that you understand that you are required to submit your visa to the United States Immigration Officer at the port where you apply to enter the United States, and that possession \fof the visa does not entitle you to enter the United States if, upon your arrival, you are found to be inadmissible under U.S. immigration laws. You certified that you understand that any willfully false or misleading statement or willful concealment of a material fact made by you within the application may subject you to permanent exclusion from the United States and, if you are admitted to the United States, may subject you to criminal prosecution and/or deportation.The information that you have provided in your application and other information submitted with your application may be accessible to other government agencies having statutory or other lawful authority to use such information, including for law enforcement and immigration law enforcement purposes. If fingerprints are collected as part of your application process, they may be used for the purpose of comparing them to other fingerprints in the FBI’s Next Generation Identification (NGI) fingerprint system or its successor systems (including civil, criminal, and latent fingerprint repositories). The photograph that you provide with your application may be used for employment verification or other U.S. law purposes.This site is managed by the Bureau of Consular Affairs, U.S. Department of State. External links to other Internet sites should not be construed as an endorsement of the views contained therein.  Copyright Information   Disclaimers   Paperwork Reduction Act(229)"
}