{
  "messageId": "19af5ed787fe7622",
  "subject": "Fwd: TQL PO 33874399 eRate Confirmation",
  "date": "Sat, 6 Dec 2025 15:09:18 -0800",
  "timestamp": 1765062558.0,
  "attachmentName": "Carrier Rate confirmation.pdf",
  "gmailQueryUsed": "subject:confirmation",
  "targetMimes": [
    "application/pdf"
  ],
  "attachmentContentText": "TQL RATE CONFIRMATION FOR PO# 33874399TO ENSURE PROMPT PAYMENT, SUBMIT THIS RATE CONFIRMATION, COMPLETE BOL(S)/POD, RECEIPTS AND OTHER APPLICABLE PAPERWORK WITHIN 24 HOURS OF DELIVERY TO CINVOICES@TQL.COM. FOR OTHER OPTIONS, SEE NEXT PAGE.FIND YOUR NEXT LOAD BY VISITINGCARRIERDASHBOARD.TQL.COMTQL CONTACT INFONamePhoneEmailFaxFitzgerald White800-580-3101 x37834FWhite@TQL.com0           Office Staffed 24/7CARRIER CONTACTMC#/DOT#NamePhoneTermsFax910612 / 2594815Sai Truck Company Inc (ca)408-565-5166   28DAYS559-390-0015   AddressLOVE'S SOLUTIONS LLC  (OKLAHOMA) - FCM P.O. BOX  96-0479   OKLAHOMA CITY, OK 73196-0479DispatcherDriverTruck #Trailer #Harginder singhmarcus02        S04LOAD INFORMATIONRateTypeUnitQuantityTotal$2,500.00Line HaulFlat1.0000$2,500.00Rates that are based on weight or count will be calculated from the quantities loaded.Total: $2,500.00 USDCARRIER RESPONSIBLE FORModeTrailer TypeTrailer SizeLinear FeetTemperaturePallet/Case CountHazmatLoad RequirementsFTLReefer53 ft25F0 pallets/0 casesNon-HazardousSpecial Temp InstructionsLxWxHPick-up LocationDateTimeClinton, NC12/5/2025FCFS 00:00Delivery LocationDateTimeLaredo, TX12/8/2025FCFS 08:00UnloadingNone w/ valid unloading receiptPallet ExchangeNoneEstimated Weight40000Note toCarrierBOL'S TO BE SENT VIA EMAIL FWHITE@TQL.COM IMMEDIATELY AFTER PICK-UPS. IF NOT SENT $50 DEDUCTIONIF TEMPERATURE DISCREPANCY PLEASE CALL BROKER IMMEDIATELY.TRACKING REQUIRED ON ALL SHIPMENTS, IF NOT DETENTION WILL NOT BE PAID.ODOR FREE TRAILERS.Pick Up #QuantityUnitCommodityNotes11TruckloadFresh PorkCommodities:\fIf this box is checked, Carrier is required to mail original paperwork to TQL at the below address. CARRIER INVOICE #OVERNIGHT INVOICINGTQL1701 Edison DriveMilford, OH 45150FOR STANDARD MAILTQLPO Box 799Milford, OH 45150DOCUMENT SCANNINGTQL Carrier Dashboard - Send paperworkfor FREE via our web and mobile appTRANSFLO Express allows you to scan and send invoicesand POD’s to TQL for $3.50 from participating truck stops.EMAILFAXQuick Pay - Quickpay@tql.comStandard - cinvoices@tql.comQuick Pay - 513-688-8895Standard - 513-688-8782METHODS TO SUBMIT PAPERWORKIf your default payment terms are not Quick Pay and you would like Quick Pay on this load, please check one of the boxes below. Send your invoice to the Quick Pay email or fax listed below or via one of the document scanning options.1 Day Quick Pay 5%7 Day Quick Pay 3%QUICK PAYSubmit completed and signed paperwork within 24 hours of delivery.TQL must approve all accessorial terms/charges in advance and in writing. Payment of detention is determined on a load-by-load basis. Unauthorized charges will not be paid. Detention payment does not begin for at least 3 hours unless otherwise agreed to in writing. To qualify for additional compensation, the Carrier MUST notify TQL at least 30 minutes before beginning detention time and when arriving-on-time/departing from all shippers/receivers (unless the shipper/receiver will notate check in/out times on the paperwork). TQL reserves the right to deny all additional charges unless communicated in advance writing and invoiced to TQL within 90 days of load completion. All demurrage, detention, and per diem charges must be communicated to TQL in writing within 30 days of load completion in order to validate and/or dispute with the steam ship line directly. TQL reserves the right to deny all demurrage, detention, and per diem charges communicated more than 30 days from invoice date. Carrier must file any disputes in regards to demurrage, detention, and per diem charges in writing with the billing party within 7 days from date of invoice.THIS IS AN AGREEMENT BETWEEN TQL AND CARRIER. THIS AGREEMENT IS SUBJECT TO THE TERMS OF THE BROKER-CARRIER AGREEMENT SIGNED BY THE CARRIER AND TQL. THIS AGREEMENT IS AN ADDENDUM TO THE BROKER-CARRIER AGREEMENT. CARRIER SHALL HAUL THE LOAD AT THE RATE ABOVE. CARRIER SHALL CALL TQL FOR LOAD INFORMATION. IF LOAD IS CHANGED OR CANCELED BY TQL, NO “TRUCK ORDER NOT USED” WILL BE PAID UNLESS TQL HAS PROVIDED THE CARRIER WITH LOAD DETAILS (PICK-UP NUMBER, SHIPPER NAME/ADDRESS AND DRIVER INFORMATION SHEET) AND APPROVED THE CARRIER TO BEGIN DRIVING TOWARDS THE PICK-UP LOCATION. THE SAFE, LEGAL AND PROPER OPERATION OF CARRIER SUPERSEDES ANY REQUEST, DEMAND, PREFERENCE, INSTRUCTION OR INFORMATION PROVIDED BY TQL OR ITS CUSTOMERS WITH RESPECT TO ANY SHIPMENT. IF ANY EMPLOYEE OF TQL OR ITS CUSTOMER REQUESTS, DEMANDS, OR INSTRUCTS CARRIER TO TAKE ANY ACTION THAT VIOLATES ANY LAW, CARRIER SHALL REFUSE TO TRANSPORT THE LOAD AND IMMEDIATELY CONTACT TQL BEFORE TAKING ANY FURTHER ACTION. CARRIER AGREES THAT WHEN IT CHOOSES TO TRANSPORT A LOAD IT DOES SO ON ITS OWN VOLITION, EXERCISING ITS OWN DISCRETION WITHOUT COERCION OR UNDUE INFLUENCE BY ANY INDIVIDUAL OR ENTITY. BY SIGNING THIS RATE CONFIRMATION AND/OR PERFORMING SERVICES FOR BROKER, CARRIER AFFIRMS THAT IT MAINTAINS KNOWLEDGE OF AND COMPLIANCE WITH ALL FEDERAL, STATE, AND LOCAL LAWS AND REGULATIONS, WHICH INCLUDES, BUT IS NOT LIMITED TO, ANY LAWS OR REGULATIONS RELATED TO CARB COMPLIANCE, THE CALIFORNIA TRANSPORT REFRIGERATION UNIT (TRU) OR AIRBORNE TOXIC CONTROL MEASURE (ATCM). CARRIER AFFIRMS THAT ALL OF ITS APPLICABLE EQUIPMENT TRAVELLING TO, FROM, OR WITHIN CALIFORNIA IS IN COMPLIANCE WITH CARB RULES AND REGULATIONS OR ANY OTHER SIMILAR REGULATIONS IN OTHER STATES WHEN TRAVELLING TO, FROM, OR WITHIN SUCH OTHER STATES. CARRIER FURTHER AFFIRMS THAT ALL EQUIPMENT IN ITS FLEET, INCLUDING ANY TRU EQUIPMENT, FURNISHED WILL BE IN COMPLIANCE WITH THE IN-USE REQUIREMENTS OF ALL OF CALIFORNIA’S TRU REGULATIONS AND, IF APPLICABLE, ANY ADDITIONAL REQUIREMENTS REQUIRED OF BROKER’S CUSTOMER. CARRIER WILL BE RESPONSIBLE FOR ANY AND ALL FINES ASSESSED AGAINST ANY PARTY FOR CARRIER’S FAILURE TO ADHERE, IN WHOLE OR IN PART, TO ANY REGULATION OR LAWS. THIS RATE CONFIRMATION IS INCLUSIVE OF ALL CHARGES.IF THIS SHIPMENT RELATES TO A GOVERNMENT OR QUASI-GOVERNMENT CONTRACT (WHICH MAY INCLUDE, WITHOUT LIMITATION, FEDERAL, STATE, MUNICIPAL, OR POSTAL CONTRACTS), THEN THE SHIPMENT IS SUBJECT TO THE NOTICES AND COMPLIANCE REQUIREMENTS FOUND AT HTTPS://WWW.TQL.COM/GOVERNMENT-CONTRACTOR-NOTICES.PDF OR A HARD COPY WILL BE PROVIDED UPON REQUEST TO 800-580-3101.CARRIER AGREES TO THE DATA PROCESSING AGREEMENT (\"DPA\") FOUND AT HTTPS://WWW.TQL.COM/CARRIER-DATA-PROCESSING-AGREEMENT (OR A COPY WILL BE PROVIDED UPON WRITTEN REQUEST TO COMPLIANCE@TQL.COM), WHICH DPA IS INCORPORATED HEREIN BY REFERENCE.BY SIGNING THIS DOCUMENT, THE CARRIER AND ITS DRIVER AGREE THAT THEY MAY LEGALLY RECEIVE SMS (TEXT) MESSAGES ORIGINATING FROM TQL.RESPONDING TO OR READING A TQL SMS MESSAGE WHILE DRIVING A TRUCK OR MOTOR VEHICLE CAN CAUSE SERIOUS INJURY, DEATH, OR PROPERTYDAMAGE TO YOU OR OTHERS. DO NOT READ OR REPLY TO A MESSAGE UNLESS YOUR VEHICLE IS STATIONARY AND PARKED. THE CARRIER, DRIVER, ANDANY OTHER EMPLOYEE AND/OR AGENT FOR CARRIER ASSUME ALL RESPONSIBILITY FOR ABIDING BY THESE INSTRUCTIONS AND AGREE THAT THEYWILL COMPLY WITH ALL APPLICABLE FEDERAL, STATE AND LOCAL LAWS INCLUDING, BUT NOT LIMITED TO: RECEIVING, READING AND/OR SENDING SMSMESSAGES, PHONE CALLS, AND/OR ANY OTHER INFORMATION TO OR FROM THE BROKER. CARRIER AGREES TO INDEMNIFY AND HOLD TQL HARMLESS TOTHE FULLEST EXTENT PERMITTED BY LAW FOR ANY AND ALL CLAIMS OF ANY NATURE ARISING OUT OF OR RELATING TO THE HAULING OF THIS LOAD, THEVIOLATION OF THE TERMS OF THE BROKER-CARRIER AGREEMENT OR THIS RATE CONFIRMATION.\fTQL PO# 33874399__________________________________Carrier Representative Signature*By electronically signing below and acknowledging acceptance, I confirm I have the authority to acton behalf of, and bind the undersigned individual and/or entity and have agreed to the termsName* S/harjinder singh"
}